In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [6]:
import numpy as np
import pandas as pd

In [12]:
emp = pd.read_csv("c:\\ds_work\\data\\emp.csv")
dept = pd.read_csv("c:\\ds_work\\data\\dept.csv")

123

In [13]:
result[['ename']]

NameError: name 'result' is not defined

In [4]:
#Q3) 봉급이 3000이상의 사원의 이름과 봉급, 부서위치 출력

In [5]:
result[['ename','sal','loc']][result['sal']>=3000]

NameError: name 'result' is not defined

#Q4) SELECT E.ENAME, D.LOC
     FROM EMP E, DEPT D
     WHERE E.DEPTNO(+) = D.DEPTNO;
     
     SELECT ENAME, LOC
     FROM EMP RIGHT OUTER JOIN DEPT
     USING(DEPTNO);
     를 이용해서 pandas로 출력

In [11]:
# join한 것에서 추출
emp = pd.read_csv("c:\\ds_work\\data\\emp.csv")
dept = pd.read_csv("c:\\ds_work\\data\\dept.csv")
res04= pd.merge(emp,dept, on = 'deptno',how='right')
# emp(종), dept(주) RIGHT OUTER JOIN
res04[['ename','loc']]

     ename       loc
0     KING  NEW YORK
1    CLARK  NEW YORK
2   MILLER  NEW YORK
3    JONES    DALLAS
4     FORD    DALLAS
5    SMITH    DALLAS
6    SCOTT    DALLAS
7    ADAMS    DALLAS
8    BLAKE   CHICAGO
9   MARTIN   CHICAGO
10   ALLEN   CHICAGO
11  TURNER   CHICAGO
12   JAMES   CHICAGO
13    WARD   CHICAGO
14     NaN    BOSTON

Q5 서브쿼리 사용 JONES의 월급보다 더 많이 받는 사원의 이름과 월급을 출력
select ename, sal
from emp
where sal > (select sal from emp where ename = 'JONES');

In [21]:
# dataframe에서는 서브쿼리를 2번 처리해야 한다
#5-1 jones월급
jsal = emp['sal'][emp['ename'] =='JONES']
jsal
jsal.values[0]
#.values[0]을 붙이는 이유


jsal = emp['sal'][emp['ename'] =='JONES'].values[0]

#5-2 값으로 비교 연산 후 쿼리 리턴
emp[['ename','sal']][emp['sal']>jsal]

3    2975
Name: sal, dtype: int64

2975

    ename   sal
0    KING  5000
9    FORD  3000
11  SCOTT  3000

Q6) 서브쿼리
select ename, sal  
from emp where job = (select job from emp where ename = 'SCOTT')  
and ename != 'SCOTT';  

pandas (and : &)(or : |)(~ : not)(!= : 같지 않다)  
연산자를 사용할때는 ()로 묶어서 결과를 boolean으로 리턴

In [27]:
s_job = emp['job'][emp['ename'] =='SCOTT'].values[0]

#5-2 값으로 비교 연산 후 쿼리 리턴
emp[['ename','sal']][(emp['job']==s_job) & (emp['ename'] !='SCOTT')]

  ename   sal
9  FORD  3000

In [29]:
# Q7)sql을 이용한 집합함수
emp['sal'].max()
emp['sal'].min()
emp['sal'].sum()
emp['sal'].var() # 분산
sal_std = emp['sal'].std() # 표준편차

5000

800

29025

1398313.8736263737

Q8) 20번 부서의 봉급의 합을 구하시오  
select sum(sal) from emp where deptno = 20;

In [30]:
emp['sal'][emp['deptno']==20].sum()

10875

Q09) 
select job, max(sal)  
from emp  
group by job;

In [32]:
result=emp.groupby('job')['sal'].max() # Series(컬럼)
result

job
ANALYST      3000
CLERK        1300
MANAGER      2975
PRESIDENT    5000
SALESMAN     1600
Name: sal, dtype: int64

In [38]:
#.reset_index() : DataFrame(테이블)
result=emp.groupby('job')['sal'].max().reset_index()
result
type(result)

         job   sal
0    ANALYST  3000
1      CLERK  1300
2    MANAGER  2975
3  PRESIDENT  5000
4   SALESMAN  1600 <class 'pandas.core.frame.DataFrame'>

pandas.merge( emp_left, dept_right, how='inner', on='deptno')  

옵션:  how ='inner' : emp 와 dept 데이터 프레임에 공통적으로 존재하는  
                          교집합일 경우에만 추출하겠다.  
        how ='outer' : 열의 데이터가 양쪽 데이터 프레임에 공통적으로   
                           존재하는 교집합이 아니어도 추출하겠다.  
        how ='left'  :   왼쪽 데이터 프레임의 키열에 속하는 데이터값을  
                           기준으로 병합하겠다.  
        hot = 'right' :  오른쪽 데이터 프레임의 키열에 속하는 데이터 값을  
                           기준으로 병합하겠다.

Q10) 부서번호, 부서번호별 평균월급 출력
select deptno, avg(sal)
from emp
group by deptno;

In [39]:
emp.groupby('deptno')['sal'].mean().reset_index()

   deptno          sal
0      10  2916.666667
1      20  2175.000000
2      30  1566.666667

In [40]:
#Q11) 만일의 10번의 결과를 정수로 출력하고 싶다
emp.groupby('deptno')['sal'].mean().reset_index().astype(int)

   deptno   sal
0      10  2916
1      20  2175
2      30  1566

In [41]:
#Q12) 직업과 직업별 월급의 합을 출력
emp.groupby('job')['sal'].sum().reset_index()

         job   sal
0    ANALYST  6000
1      CLERK  4150
2    MANAGER  8275
3  PRESIDENT  5000
4   SALESMAN  5600

In [47]:
emp.head()
dept.head()

   empno   ename        job     mgr         hiredate   sal    comm  deptno
0   7839    KING  PRESIDENT     NaN  1981-11-17 0:00  5000     NaN      10
1   7698   BLAKE    MANAGER  7839.0  1981-05-01 0:00  2850     NaN      30
2   7782   CLARK    MANAGER  7839.0  1981-05-09 0:00  2450     NaN      10
3   7566   JONES    MANAGER  7839.0  1981-04-01 0:00  2975     NaN      20
4   7654  MARTIN   SALESMAN  7698.0  1981-09-10 0:00  1250  1400.0      30

   index  deptno       dname       loc
0      0      10  ACCOUNTING  NEW YORK
1      1      20    RESEARCH    DALLAS
2      2      30       SALES   CHICAGO
3      3      40  OPERATIONS    BOSTON

In [56]:
#Q13) 부서위치와 부서위치별 
mg = pd.merge( emp, dept, on='deptno') 
mg.groupby('loc')['sal'].sum().reset_index()
# dept.groupby('dname')['deptno'].sum().reset_index()

        loc    sal
0   CHICAGO   9400
1    DALLAS  10875
2  NEW YORK   8750